app/views/contributions/create.js.erb

        if (contribution.success.customer.previous_changes.id) {
          $('.dt-filter')
            .find('optgroup[label="Customer"]')
            .prepend(
              $('<option value="customer-' + contribution.success.customer_id.toString() + '"' +
                ' data-column="customer">' + contribution.success.customer.name + '</option>')
            )
---
SELECT  "successes".* FROM "successes" WHERE "successes"."id" = $1 LIMIT 1  [["id", 285]]

  // update app.contributions
  app.contributions.push(contribution)
---
INSERT INTO "contributions" ("user_id", "success_id", "role", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2267], ["success_id", 285], ["role", "partner"], ["status", "pre_request"], ["created_at", "2016-01-05 04:32:04.742848"], ["updated_at", "2016-01-05 04:32:04.742848"]]