app/views/stories/edit.html.erb

                                          @story.success.customer) %>">
                        Research <%= contribution.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2078]]