app/views/stories/edit.html.erb

            <a target="_blank" tabindex="-1"
              href="http://google.com/search?q={{= contribution.contributor.first_name + '+' + contribution.contributor.last_name + '+' + contribution.success.customer.name }}">
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 285]]
SELECT  "successes".* FROM "successes" WHERE "successes"."id" = $1 LIMIT 1  [["id", 285]]