app/views/stories/show.html.erb

          <h3 class='text-center'>Results</h3>
          <% @story.success.results.each do |result| %>
---
SELECT  "successes".* FROM "successes" WHERE "successes"."id" = $1 LIMIT 1  [["id", 316]]