app/views/stories/show.html.erb


      <%= render(
            'stories/show/testimonial',
            {
              story: @story,
              video_present: @story.video_url.present?,
              long_customer_name: @story.customer.name.length > 20
            }
          ) %>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 316]]