app/controllers/companies_controller.rb

  def set_company
    @company = Company.find params[:id]
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 2]]