app/controllers/contributions_controller.rb

INSERT INTO "contributions" ("user_id", "success_id", "role", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2267], ["success_id", 285], ["role", "partner"], ["status", "pre_request"], ["created_at", "2016-01-05 04:32:04.742848"], ["updated_at", "2016-01-05 04:32:04.742848"]]
---
  def create
    @contribution = Contribution.create(contribution_params)

UPDATE "contributions" SET "status" = $1, "contribution" = $2, "linkedin" = $3, "updated_at" = $4 WHERE "contributions"."id" = $5  [["status", "contribution"], ["contribution", "blah blah"], ["linkedin", "t"], ["updated_at", "2016-01-05 04:52:12.647259"], ["id", 2262]]
---
  def update
    if params[:data]  # crowdsourcing template (datatables inline editor)
      @contribution.crowdsourcing_template_id =
          params[:data].values[0][:crowdsourcing_template][:id]
      @contribution.save

SELECT  "contributions".* FROM "contributions" WHERE "contributions"."id" = $1 LIMIT 1  [["id", 2262]]
---
  def set_contribution
    @contribution = Contribution.find(params[:id])