app/controllers/profile_controller.rb

  def linkedin
    if user_signed_in?  # company admin or curator
      if current_user.update linkedin_url: auth_hash[:info][:urls][:public_profile]
        @linkedin_data = auth_hash
        flash.now[:info] = 'Connected to LinkedIn!'
        if current_user.company_id.nil?
          @company = Company.new
        else
          # note we're not eager loading like we are in companies#show.  research
          @company = current_user.company
          @customers = @company.customers_select
          @product_categories = @company.product_categories_select # multiple select
          @products = @company.products_select # single select (for now)
          @industries = @company.industries_select # multiple select
        end
        render template: 'companies/show'
      else
        # flash.now[:danger] = "Problem updating linkedin_url field for #{}"
      end
    else # contributor
      contribution = Contribution.find(request.env["omniauth.params"]["contribution"])
---
UPDATE "users" SET "linkedin_url" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["linkedin_url", "https://www.linkedin.com/in/wilsonryanc"], ["updated_at", "2016-01-07 23:52:44.359958"], ["id", 2505]]
SELECT  "contributions".* FROM "contributions" WHERE "contributions"."id" = $1 LIMIT 1  [["id", 2500]]