app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories" INNER JOIN "successes" ON "stories"."success_id" = "successes"."id" INNER JOIN "customers" ON "successes"."customer_id" = "customers"."id" WHERE "customers"."company_id" = $1  [["company_id", 2]]
---
  def index
    set_or_redirect_to_story_preview(params[:preview], session[:preview_story_slug])

    @tags_filter = get_filters_from_query_or_plugin(@company, params)

    @featured_stories = @company.stories.featured.order([published: :desc, preview_published: :desc, updated_at: :desc])