app/controllers/stories_controller.rb

  def update
    # puts 'stories#update'
    # awesome_print(story_params.to_h)
    story = Story.find_by_id params[:id]
    if params[:settings]
      story.success.cta_ids = params[:ctas]
      if @story.update(story_params)

        # TODO: a better way of handling google errors
        # => only way to get errors back from the associated ad is to validate it,
        #    but present scheme dictates that the ad exists even if it has no ad_id
        #    (and that's how it would be validated: presence of ad_id)
        # => adding errors to self.story.errors[:base] doesn't seem to work
        # => if all companies push to google regardless of promote_tr?,
        #     model validations can be made easier by checking for AdwordsAd.ad_id on create
        if story.company.promote_tr? && story.was_published?
          gads_errors = gads_errors(story, story.company.gads_requirements_checklist)
        end
      else
        story_errors = @story.errors.full_messages
      end
      # html response necessary for uploading customer logo image
      respond_to do |format|
        format.js do
          @response_data = {}
          @response_data[:storyErrors] = story_errors.present? ? story_errors : nil
          @response_data[:gadsErrors] = gads_errors.present? ? gads_errors : nil
          @response_data[:newAds] = new_ads(story_params.to_h, story.id)
          @response_data[:adsWereDestroyed] = ads_were_destroyed?(story_params.to_h)
          @response_data[:gadsWereCreated] = gads_errors.blank? &&
                                             gads_were_created?(new_ads(story_params.to_h, story.id))
---
SELECT  "successes".* FROM "successes" WHERE "successes"."id" = $1 LIMIT 1  [["id", 316]]