app/controllers/stories_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 316]]
---
  def show
    if params[:remove_video].present?
      if params[:xs_screen]
        render({
          partial: 'stories/show/video_xs',
          locals: { story: @story, include_video: false }
        })
      else
        render({
          partial: 'stories/show/testimonial',
          locals: { story: @story, include_video: false }
        })
      end
    end
    # convert the story content to plain text (for SEO tags)
    @story_content_text = HtmlToPlainText.plain_text(@story.content)
    @related_stories = @story.related_stories
    @more_stories =
      @company.filter_stories_by_tag({ tag: 'all', id: '0' })
              .delete_if { |story| story.id == @story.id || story.customer.logo_url.blank? }
              .map do |story|

SELECT  "successes".* FROM "successes" WHERE "successes"."id" = $1 LIMIT 1  [["id", 285]]
SELECT "contributions".* FROM "contributions" WHERE "contributions"."success_id" = $1  [["success_id", 285]]
---
  def edit
    # want to catch an ajax request for _edit partial, but ignore tubolinks ajax requests
    if request.xhr? && !request.env["HTTP_TURBOLINKS_REFERRER"]
      render({
        partial: 'stories/edit/edit',
        locals: {
          company: @company,
          story: @story,
          workflow_stage: 'curate',
          tab: 'settings'
        }
      })
    else
      # provide data for both stories#edit and companies#show views
      @customer = @story.success.customer
      @referrer_select = @story.success.contributions
                               .map { |c| [ c.contributor.full_name, c.contributor.id ] }
                               .unshift( [""] )

INSERT INTO "stories" ("title", "success_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Google is great"], ["success_id", 396], ["created_at", "2016-01-08 21:13:26.614963"], ["updated_at", "2016-01-08 21:13:26.614963"]]
---
  def create
    pp(story_params)
    @story = Story.new(story_params)
    if @story.save

UPDATE "stories" SET "logo_published" = $1, "updated_at" = $2 WHERE "stories"."id" = $3  [["logo_published", "t"], ["updated_at", "2016-01-05 05:15:58.181757"], ["id", 191]]
---
  def update
    if params[:settings]
      pp params
      @story.success.cta_ids = params[:ctas]
      @story.update(story_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 2]]
---
  def set_company
    if params[:company_id]  # create story
      @company = Company.find(params[:company_id])

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 210]]
---
  def set_story
    @story = Story.find(params[:id])

INSERT INTO "successes" ("customer_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["customer_id", 392], ["created_at", "2016-01-08 21:13:26.610564"], ["updated_at", "2016-01-08 21:13:26.610564"]]
---
  def set_contributors story
    curator = story.success.curator
    @contributors =
        User.joins(own_contributions: { success: {} })
            .where.not(linkedin_url:'')
            .where(successes: { id: story.success_id },
                   contributions: { publish_contributor: true })
            .order("CASE contributions.role
                      WHEN 'customer' THEN '1'
                      WHEN 'customer success' THEN '2'
                      WHEN 'sales' THEN '3'
                    END")
            .to_a
            .delete_if { |c| c.id == curator.id } # remove the contributor;
                                                  # he goes at the end
    @contributors << curator unless curator.linkedin_url.blank?